import 'dart:convert';
import 'package:novel_app/models/novel.dart';

class GetUserAllNovels {
  static Future<List<Novel>> fetchNovels() async {
    await Future.delayed(const Duration(seconds: 1));

    final String dummyNovelsJson = """
      [
        {
          "title": "普通の小説",
          "content": "普通の内容",
          "created_at": "2025-11-15T10:00:00Z",
          "reading_minutes": 5
        },
        {
          "title": "短",
          "content": "短",
          "created_at": "2025-11-15T14:30:00Z",
          "reading_minutes": 1
        },
        {
          "title": "長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説",
          "content": "長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容",
          "created_at": "2025-11-15T08:45:00Z",
          "reading_minutes": 15
        },
        {
          "title": "長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説",
          "content": "長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容",
          "created_at": "2025-11-15T08:45:00Z",
          "reading_minutes": 15
        },
        {
          "title": "長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説",
          "content": "長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容",
          "created_at": "2025-11-15T08:45:00Z",
          "reading_minutes": 15
        },
        {
          "title": "長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説",
          "content": "長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容",
          "created_at": "2025-11-15T08:45:00Z",
          "reading_minutes": 15
        },
        {
          "title": "長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説",
          "content": "長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容",
          "created_at": "2025-11-15T08:45:00Z",
          "reading_minutes": 15
        },
        {
          "title": "長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説長い小説",
          "content": "長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容長い内容",
          "created_at": "2025-11-15T08:45:00Z",
          "reading_minutes": 15
        }
      ]
    """;

    final List<dynamic> decodedJson = json.decode(dummyNovelsJson);
    return decodedJson.map((json) => Novel.fromJson(json as Map<String, dynamic>)).toList();
  }
}